#include <stdio.h>
//<locale.h> для локализации 1.4
#include <locale.h>

//4. Объедините созданные подпрограммы в новом проекте
void main()
{
	//1.4 Рус.яз
	setlocale(LC_CTYPE, "RUS");
	void zadanie1();
	void zadanie2();
	void zadanie3();

}
void zadanie1()
{
	//Повторите код примера 1.
	puts("1.1. Моя программа");

	//1.5 Добавьте вызов функции getchar();
	puts("Нажмите Enter для продолжения...");

	getchar(); // ожидание нажатия Enter

	puts("Продолжение программы");

	//1.2 Осуществите вывод сообщения "Hello Word!".
	puts("1.2. Hello Word!");

	//1.6 1.6 Добавьте оператор return 0;
	return 0;
}

void zadanie2()
{
	//2. Напишите программу, которая выводит тему лабораторной работы, и информацию об ее исполнителе (группа, студент).
	puts("**********************************************");
	puts("*                                            *");
	puts("*  тема: Разработка консольного приложения   *");
	puts("*                                            *");
	puts("*    Выполнила Федорова Е. А бИД-261         *");
	puts("*                                            *");
	puts("**********************************************");

	return 0;
}

void zadanie3()
{
	//3. Составьте программу, которая выводит число, месяц и последние две цифры года рождения.
	puts("           _         _   _   _   _   _  ");
	puts("  /| | |  | |  /|   | | | | | | | | |_  ");
	puts(" / | |_|  | | / |    /  | | | | | | | | ");
	puts("   |   |. |_|   | . /_  |_| |_| |_| |_| ");

	return 0;
}