#include <stdio.h>
#include <locale.h>

void main()
{
	setlocale(LC_CTYPE, "RUS");
	//2. Напишите программу, которая выводит тему лабораторной работы, и информацию об ее исполнителе (группа, студент).
	puts("**********************************************");
	puts("*                                            *");
	puts("*  тема: Разработка консольного приложения   *");
	puts("*                                            *");
	puts("*    Выполнила Федорова Е. А бИД-261         *");
	puts("*                                            *");
	puts("**********************************************");

	return 0;

}